# Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.
f_list = [5, 3.7, 6+8j, 'собака', None, True, (1, 2), {1, 2}, [1, 2]]
for element in f_list:
    print(type(element))






