# Необходимо создать (не программно) текстовый файл, где каждая строка описывает учебный предмет и наличие лекционных,
# практических и лабораторных занятий по этому предмету и их количество.
# Важно, чтобы для каждого предмета не обязательно были все типы занятий.
# Сформировать словарь, содержащий название предмета и общее количество занятий по нему.
# Вывести словарь на экран.
# Примеры строк файла: Информатика:   100(л)   50(пр)   20(лаб).
#                                         Физика:   30(л)   —   10(лаб)
#                                         Физкультура:   —   30(пр)   —
# Пример словаря: {“Информатика”: 170, “Физика”: 40, “Физкультура”: 30}
res = {}
with open('task_5.6.txt') as f_obj:
    content = f_obj.readlines()
    for line in content:
        quantity = 0
        subject, time = line.split(':')
        hours = time.split()
        for el in hours:
            if el != '-':
                quantity += int(el.split('(')[0])
        res[subject] = quantity
print(res)
